app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2021-02-17 07:20:51.991279"], ["updated_at", "2021-02-17 07:20:51.991279"]]
---
  def create
    @article = Article.create(title: params[:title], description: params[:description])

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "My article description"], ["updated_at", "2021-02-17 07:22:47.984750"], ["id", 1]]
---
  def update
    @article.update(title: params[:article][:title])